[
    {
        "id": "10_0_25",
        "question": "What are the anatomical entities including cell types, if any, where the human gene APOC1 is expressed at the post-juvenile stage along with its expression score independently of the strain and sex? Provide also the taxon scientific name and the taxon common name and the gene identifier.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nSELECT DISTINCT ?cellType ?expressioncondition ?organism ?taxon ?gene_identifier ?anatomicalentity ?anatomicalentityName ?cellTypeName ?efo_0000399 ?score ?expression ?taxon_scientificname ?gene ?taxon_commonname WHERE { \n\t?gene a orth:Gene .\n\t?expression a genex:Expression .\n\t?expression genex:hasExpressionCondition ?expressioncondition .\n\t?expression genex:hasExpressionLevel ?score .\n\t?expression genex:hasSequenceUnit ?gene .\n\t?gene rdfs:label \"APOC1\" .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anatomicalentity .\n\t?anatomicalentity a genex:AnatomicalEntity.\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?expressioncondition genex:hasAnatomicalEntity ?cellType .\n\t?cellType rdfs:label ?cellTypeName .\n\t?expressioncondition genex:hasDevelopmentalStage ?efo_0000399 .\n\t?efo_0000399 rdf:type efo:EFO_0000399 .\n\t?efo_0000399 rdfs:label \"post-juvenile\" .\n\t?gene orth:organism ?organism .\n\t?organism obo:RO_0002162  ?taxon .\n\t?taxon a up:Taxon .\n\t?taxon up:commonName \"human\" .\n\t?taxon <http://purl.uniprot.org/core/scientificName> ?taxon_scientificname.\n\t?taxon <http://purl.uniprot.org/core/commonName> ?taxon_commonname.\n\t?gene <http://purl.org/dc/terms/identifier> ?gene_identifier.\n\tFILTER(       ?anatomicalentity !=  obo:GO_0005575       )\n\tFILTER(       ?anatomicalentity != ?cellType       )\n}"
    },
    {
        "id": "8_0_17",
        "question": "What are the anatomical entities where the human gene APOC1 is expressed in the post-juvenile stage along with its expression score independently of the strain, sex, and cell type? Provide also the strain label and the anatomical entity label.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nPREFIX up-taxon:<http://purl.uniprot.org/taxonomy/>\nPREFIX ensembl: <http://rdf.ebi.ac.uk/resource/ensembl/>\nPREFIX lscr: <http://purl.org/lscr#>\nSELECT DISTINCT ?expressioncondition ?anatomicalentity_label ?anatomicalentity ?anatomicalentityName ?expression ?score ?efo_0005135 ?efo_0005135_label ?gene WHERE { \n\t?gene a orth:Gene .\n\t?expression a genex:Expression .\n\t?expression genex:hasExpressionCondition ?expressioncondition .\n\t?expression genex:hasExpressionLevel ?score .\n\t?expression genex:hasSequenceUnit ?gene .\n\t?gene lscr:xrefEnsemblGene ensembl:ENSG00000130208 .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anatomicalentity .\n\t?anatomicalentity a genex:AnatomicalEntity.\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?expressioncondition genex:hasDevelopmentalStage obo:UBERON_0000113 .\n\t?expressioncondition genex:hasSex \"any\".\n\t?expressioncondition genex:hasStrain ?efo_0005135 .\n\t?efo_0005135 a efo:EFO_0005135.\n\t?efo_0005135 rdfs:label \"wild-type\" .\n\t?efo_0005135 <http://www.w3.org/2000/01/rdf-schema#label> ?efo_0005135_label.\n\t?anatomicalentity <http://www.w3.org/2000/01/rdf-schema#label> ?anatomicalentity_label.\n\tFILTER(     ?anatomicalentity !=  obo:GO_0005575     )\n}"
    },
    {
        "id": "4_0_30",
        "question": "What are the anatomical entities where the APOC1 Homo sapiens gene is expressed? Provide also the taxon scientific name and the taxon common name and the anatomical entity label and the anatomical entity description and the gene see also.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nSELECT DISTINCT ?organism ?taxon ?anatomicalentity_label ?anatomicalentity_description ?anatomicalentity ?anatomicalentityName ?taxon_scientificname ?gene ?gene_seealso ?taxon_commonname WHERE { \n\t?gene a orth:Gene .\n\t?gene genex:isExpressedIn ?anatomicalentity.\n\t?gene rdfs:label \"APOC1\" .\n\t?anatomicalentity a genex:AnatomicalEntity .\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t### Specifying species:\n\t?gene orth:organism ?organism .\n\t?organism obo:RO_0002162  ?taxon .\n\t?taxon a up:Taxon .\n\t?taxon up:scientificName \"Homo sapiens\" .\n\t?taxon <http://purl.uniprot.org/core/scientificName> ?taxon_scientificname.\n\t?taxon <http://purl.uniprot.org/core/commonName> ?taxon_commonname.\n\t?anatomicalentity <http://www.w3.org/2000/01/rdf-schema#label> ?anatomicalentity_label.\n\t?anatomicalentity <http://purl.org/dc/terms/description> ?anatomicalentity_description.\n\t?gene <http://www.w3.org/2000/01/rdf-schema#seeAlso> ?gene_seealso.\n}"
    },
    {
        "id": "13_0_7",
        "question": "What are the anatomical entities where the P02654 gene is expressed? Note that P02654 is a UniProtKB identifier of the APOC1 human gene. Provide also the anatomical entity label and the gene label.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up-protein:<http://purl.uniprot.org/uniprot/>\nPREFIX lscr: <http://purl.org/lscr#>\nSELECT DISTINCT ?anatomicalentity_label ?anatomicalentity ?anatomicalentityName ?gene ?gene_label WHERE { \n\t?gene a orth:Gene .\n\t?gene genex:isExpressedIn ?anatomicalentity .\n\t?gene lscr:xrefUniprot up-protein:P02654 .\n\t?anatomicalentity a genex:AnatomicalEntity .\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?anatomicalentity <http://www.w3.org/2000/01/rdf-schema#label> ?anatomicalentity_label.\n\t?gene <http://www.w3.org/2000/01/rdf-schema#label> ?gene_label.\n}"
    },
    {
        "id": "14_0_6",
        "question": "What is all the metadata related to the ENSG00000130208 gene, where ENSG00000130208 is the identifier of the APOC1 human gene.  Provide also the gene see also and the gene identifier.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX lscr: <http://purl.org/lscr#>\nPREFIX dcterms: <http://purl.org/dc/terms/>\nSELECT DISTINCT ?organism ?ncbi ?gene_identifier ?symbol ?description ?id ?ensembl ?gene ?gene_seealso ?uniprot ?links WHERE { \n\t?gene a orth:Gene .\n\t?gene rdfs:label ?symbol .\n\t?gene rdfs:seeAlso ?links .\n\t?gene dcterms:description ?description .\n\t?gene dcterms:identifier ?id .\n\t?gene orth:organism ?organism .\n\t?gene <http://www.w3.org/2000/01/rdf-schema#seeAlso> ?gene_seealso.\n\t?gene <http://purl.org/dc/terms/identifier> ?gene_identifier.\n\tOPTIONAL { ?gene lscr:xrefUniprot ?uniprot . } \n\tOPTIONAL { ?gene lscr:xrefEnsemblGene ?ensembl . } \n\tOPTIONAL { ?gene lscr:xrefNCBIGene ?ncbi . } \n\tFILTER(     ?id = \"ENSG00000130208\"     )\n}"
    },
    {
        "id": "12_0_16",
        "question": "What are the anatomical entities where the eel gene apoc1 is expressed along with its expression score independently of the strain, sex, and cell type? Provide also the strain label and the gene expression has expression level score and the gene description.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nPREFIX up-taxon:<http://purl.uniprot.org/taxonomy/>\nPREFIX lscr: <http://purl.org/lscr#>\nPREFIX dcterms: <http://purl.org/dc/terms/>\nSELECT DISTINCT ?expressioncondition ?expression_hasexpressionlevelscore ?stageIRI ?anatName ?score ?efo_0005135 ?efo_0005135_label ?anat ?expression ?gene ?gene_description WHERE { \n\t?gene a orth:Gene .\n\t?expression a genex:Expression .\n\t?expression genex:hasExpressionCondition ?expressioncondition .\n\t?expression genex:hasExpressionLevel ?score .\n\t?expression genex:hasSequenceUnit ?gene .\n\t?gene dcterms:identifier \"118230125\" .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anat .\n\t?anat rdfs:label ?anatName .\n\t?expressioncondition genex:hasDevelopmentalStage ?stageIRI .\n\t?expressioncondition genex:hasSex \"any\".\n\t?expressioncondition genex:hasStrain ?efo_0005135 .\n\t?efo_0005135 a efo:EFO_0005135.\n\t?efo_0005135 rdfs:label \"wild-type\" .\n\t?efo_0005135 <http://www.w3.org/2000/01/rdf-schema#label> ?efo_0005135_label.\n\t?expression <http://purl.org/genex#hasExpressionLevel> ?expression_hasexpressionlevelscore.\n\t?gene <http://purl.org/dc/terms/description> ?gene_description.\n\tFILTER(       ?anat !=  obo:GO_0005575       )\n}"
    },
    {
        "id": "14_0_3",
        "question": "What is all the metadata related to the ENSG00000130208 gene, where ENSG00000130208 is the identifier of the APOC1 human gene.  Provide also the gene description.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX lscr: <http://purl.org/lscr#>\nPREFIX dcterms: <http://purl.org/dc/terms/>\nSELECT DISTINCT ?organism ?ncbi ?symbol ?description ?id ?ensembl ?gene_description ?gene ?links ?uniprot WHERE { \n\t?gene a orth:Gene .\n\t?gene rdfs:label ?symbol .\n\t?gene rdfs:seeAlso ?links .\n\t?gene dcterms:description ?description .\n\t?gene dcterms:identifier ?id .\n\t?gene orth:organism ?organism .\n\t?gene <http://purl.org/dc/terms/description> ?gene_description.\n\tOPTIONAL { ?gene lscr:xrefUniprot ?uniprot . } \n\tOPTIONAL { ?gene lscr:xrefEnsemblGene ?ensembl . } \n\tOPTIONAL { ?gene lscr:xrefNCBIGene ?ncbi . } \n\tFILTER(   ?id = \"ENSG00000130208\"   )\n}"
    },
    {
        "id": "10_0_16",
        "question": "What are the anatomical entities including cell types, if any, where the human gene APOC1 is expressed at the post-juvenile stage along with its expression score independently of the strain and sex? Provide also the taxon scientific name and the gene see also.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nSELECT DISTINCT ?cellType ?expressioncondition ?organism ?taxon ?anatomicalentity ?anatomicalentityName ?cellTypeName ?efo_0000399 ?score ?expression ?taxon_scientificname ?gene ?gene_seealso WHERE { \n\t?gene a orth:Gene .\n\t?expression a genex:Expression .\n\t?expression genex:hasExpressionCondition ?expressioncondition .\n\t?expression genex:hasExpressionLevel ?score .\n\t?expression genex:hasSequenceUnit ?gene .\n\t?gene rdfs:label \"APOC1\" .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anatomicalentity .\n\t?anatomicalentity a genex:AnatomicalEntity.\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?expressioncondition genex:hasAnatomicalEntity ?cellType .\n\t?cellType rdfs:label ?cellTypeName .\n\t?expressioncondition genex:hasDevelopmentalStage ?efo_0000399 .\n\t?efo_0000399 rdf:type efo:EFO_0000399 .\n\t?efo_0000399 rdfs:label \"post-juvenile\" .\n\t?gene orth:organism ?organism .\n\t?organism obo:RO_0002162  ?taxon .\n\t?taxon a up:Taxon .\n\t?taxon up:commonName \"human\" .\n\t?taxon <http://purl.uniprot.org/core/scientificName> ?taxon_scientificname.\n\t?gene <http://www.w3.org/2000/01/rdf-schema#seeAlso> ?gene_seealso.\n\tFILTER(     ?anatomicalentity !=  obo:GO_0005575     )\n\tFILTER(     ?anatomicalentity != ?cellType     )\n}"
    },
    {
        "id": "10_0_6",
        "question": "What are the anatomical entities including cell types, if any, where the human gene APOC1 is expressed at the post-juvenile stage along with its expression score independently of the strain and sex? Provide also the gene expression has expression level score.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nSELECT DISTINCT ?cellType ?expressioncondition ?organism ?taxon ?anatomicalentity ?anatomicalentityName ?cellTypeName ?expression_hasexpressionlevelscore ?efo_0000399 ?score ?expression ?gene WHERE { \n\t?gene a orth:Gene .\n\t?expression a genex:Expression .\n\t?expression genex:hasExpressionCondition ?expressioncondition .\n\t?expression genex:hasExpressionLevel ?score .\n\t?expression genex:hasSequenceUnit ?gene .\n\t?gene rdfs:label \"APOC1\" .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anatomicalentity .\n\t?anatomicalentity a genex:AnatomicalEntity.\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?expressioncondition genex:hasAnatomicalEntity ?cellType .\n\t?cellType rdfs:label ?cellTypeName .\n\t?expressioncondition genex:hasDevelopmentalStage ?efo_0000399 .\n\t?efo_0000399 rdf:type efo:EFO_0000399 .\n\t?efo_0000399 rdfs:label \"post-juvenile\" .\n\t?gene orth:organism ?organism .\n\t?organism obo:RO_0002162  ?taxon .\n\t?taxon a up:Taxon .\n\t?taxon up:commonName \"human\" .\n\t?expression <http://purl.org/genex#hasExpressionLevel> ?expression_hasexpressionlevelscore.\n\tFILTER(   ?anatomicalentity !=  obo:GO_0005575   )\n\tFILTER(   ?anatomicalentity != ?cellType   )\n}"
    },
    {
        "id": "6_0_19",
        "question": "What are the anatomical entities where the human gene APOC1 is expressed in the post-juvenile stage? Provide also the taxon scientific name and the taxon common name and the gene identifier.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nSELECT DISTINCT ?expressioncondition ?organism ?taxon ?gene_identifier ?anatName ?efo_0000399 ?efo_0005135 ?taxon_scientificname ?anat ?gene ?taxon_commonname WHERE { \n\t?gene a orth:Gene .\n\t?gene genex:isExpressedIn ?expressioncondition.\n\t?expressioncondition a genex:ExpressionCondition.\n\t?gene rdfs:label \"APOC1\" .\n\t?expressioncondition genex:hasAnatomicalEntity ?anat .\n\t?anat rdfs:label ?anatName .\n\t?expressioncondition genex:hasAnatomicalEntity obo:GO_0005575 .\n\t?expressioncondition genex:hasDevelopmentalStage ?efo_0000399 .\n\t?efo_0000399 a efo:EFO_0000399 .\n\t?efo_0000399 rdfs:label \"post-juvenile\" .\n\t?expressioncondition genex:hasSex \"any\".\n\t?expressioncondition genex:hasStrain ?efo_0005135 .\n\t?efo_0005135 a efo:EFO_0005135.\n\t?efo_0005135 rdfs:label \"wild-type\" .\n\t?gene orth:organism ?organism .\n\t?organism obo:RO_0002162  ?taxon .\n\t?taxon a up:Taxon .\n\t?taxon up:commonName \"human\" .\n\t?taxon <http://purl.uniprot.org/core/scientificName> ?taxon_scientificname.\n\t?taxon <http://purl.uniprot.org/core/commonName> ?taxon_commonname.\n\t?gene <http://purl.org/dc/terms/identifier> ?gene_identifier.\n}"
    },
    {
        "id": "8_0_12",
        "question": "What are the anatomical entities where the human gene APOC1 is expressed in the post-juvenile stage along with its expression score independently of the strain, sex, and cell type? Provide also the strain label and the gene description.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nPREFIX up-taxon:<http://purl.uniprot.org/taxonomy/>\nPREFIX ensembl: <http://rdf.ebi.ac.uk/resource/ensembl/>\nPREFIX lscr: <http://purl.org/lscr#>\nSELECT DISTINCT ?expressioncondition ?anatomicalentity ?anatomicalentityName ?expression ?score ?efo_0005135 ?efo_0005135_label ?gene_description ?gene WHERE { \n\t?gene a orth:Gene .\n\t?expression a genex:Expression .\n\t?expression genex:hasExpressionCondition ?expressioncondition .\n\t?expression genex:hasExpressionLevel ?score .\n\t?expression genex:hasSequenceUnit ?gene .\n\t?gene lscr:xrefEnsemblGene ensembl:ENSG00000130208 .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anatomicalentity .\n\t?anatomicalentity a genex:AnatomicalEntity.\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?expressioncondition genex:hasDevelopmentalStage obo:UBERON_0000113 .\n\t?expressioncondition genex:hasSex \"any\".\n\t?expressioncondition genex:hasStrain ?efo_0005135 .\n\t?efo_0005135 a efo:EFO_0005135.\n\t?efo_0005135 rdfs:label \"wild-type\" .\n\t?efo_0005135 <http://www.w3.org/2000/01/rdf-schema#label> ?efo_0005135_label.\n\t?gene <http://purl.org/dc/terms/description> ?gene_description.\n\tFILTER(     ?anatomicalentity !=  obo:GO_0005575     )\n}"
    },
    {
        "id": "7_0_30",
        "question": "What are the anatomical entities where the human gene APOC1 is expressed in the post-juvenile stage? Provide also the taxon scientific name and the taxon common name and the developmental stage label and the gene description.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nSELECT DISTINCT ?expressioncondition ?efo_0000399_label ?organism ?taxon ?anatomicalentity ?anatomicalentityName ?efo_0000399 ?gene_description ?taxon_scientificname ?gene ?taxon_commonname WHERE { \n\t?gene a orth:Gene .\n\t?gene genex:isExpressedIn ?expressioncondition.\n\t?gene rdfs:label \"APOC1\" .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anatomicalentity .\n\t?anatomicalentity a genex:AnatomicalEntity.\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?expressioncondition genex:hasAnatomicalEntity obo:GO_0005575 .\n\t?expressioncondition genex:hasDevelopmentalStage ?efo_0000399 .\n\t?efo_0000399 a efo:EFO_0000399 .\n\t?efo_0000399 rdfs:label \"post-juvenile\" .\n\t?gene orth:organism ?organism .\n\t?organism obo:RO_0002162  ?taxon .\n\t?taxon a up:Taxon .\n\t?taxon up:commonName \"human\" .\n\t?taxon <http://purl.uniprot.org/core/scientificName> ?taxon_scientificname.\n\t?taxon <http://purl.uniprot.org/core/commonName> ?taxon_commonname.\n\t?efo_0000399 <http://www.w3.org/2000/01/rdf-schema#label> ?efo_0000399_label.\n\t?gene <http://purl.org/dc/terms/description> ?gene_description.\n}"
    },
    {
        "id": "7_0_24",
        "question": "What are the anatomical entities where the human gene APOC1 is expressed in the post-juvenile stage? Provide also the taxon scientific name and the taxon common name and the anatomical entity description.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nSELECT DISTINCT ?expressioncondition ?organism ?taxon ?anatomicalentity_description ?anatomicalentity ?anatomicalentityName ?efo_0000399 ?taxon_scientificname ?gene ?taxon_commonname WHERE { \n\t?gene a orth:Gene .\n\t?gene genex:isExpressedIn ?expressioncondition.\n\t?gene rdfs:label \"APOC1\" .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anatomicalentity .\n\t?anatomicalentity a genex:AnatomicalEntity.\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?expressioncondition genex:hasAnatomicalEntity obo:GO_0005575 .\n\t?expressioncondition genex:hasDevelopmentalStage ?efo_0000399 .\n\t?efo_0000399 a efo:EFO_0000399 .\n\t?efo_0000399 rdfs:label \"post-juvenile\" .\n\t?gene orth:organism ?organism .\n\t?organism obo:RO_0002162  ?taxon .\n\t?taxon a up:Taxon .\n\t?taxon up:commonName \"human\" .\n\t?taxon <http://purl.uniprot.org/core/scientificName> ?taxon_scientificname.\n\t?taxon <http://purl.uniprot.org/core/commonName> ?taxon_commonname.\n\t?anatomicalentity <http://purl.org/dc/terms/description> ?anatomicalentity_description.\n}"
    },
    {
        "id": "12_0_17",
        "question": "What are the anatomical entities where the eel gene apoc1 is expressed along with its expression score independently of the strain, sex, and cell type? Provide also the strain label and the gene expression has expression level score and the gene see also.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nPREFIX up-taxon:<http://purl.uniprot.org/taxonomy/>\nPREFIX lscr: <http://purl.org/lscr#>\nPREFIX dcterms: <http://purl.org/dc/terms/>\nSELECT DISTINCT ?expressioncondition ?expression_hasexpressionlevelscore ?stageIRI ?anatName ?score ?efo_0005135 ?efo_0005135_label ?anat ?expression ?gene ?gene_seealso WHERE { \n\t?gene a orth:Gene .\n\t?expression a genex:Expression .\n\t?expression genex:hasExpressionCondition ?expressioncondition .\n\t?expression genex:hasExpressionLevel ?score .\n\t?expression genex:hasSequenceUnit ?gene .\n\t?gene dcterms:identifier \"118230125\" .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anat .\n\t?anat rdfs:label ?anatName .\n\t?expressioncondition genex:hasDevelopmentalStage ?stageIRI .\n\t?expressioncondition genex:hasSex \"any\".\n\t?expressioncondition genex:hasStrain ?efo_0005135 .\n\t?efo_0005135 a efo:EFO_0005135.\n\t?efo_0005135 rdfs:label \"wild-type\" .\n\t?efo_0005135 <http://www.w3.org/2000/01/rdf-schema#label> ?efo_0005135_label.\n\t?expression <http://purl.org/genex#hasExpressionLevel> ?expression_hasexpressionlevelscore.\n\t?gene <http://www.w3.org/2000/01/rdf-schema#seeAlso> ?gene_seealso.\n\tFILTER(       ?anat !=  obo:GO_0005575       )\n}"
    },
    {
        "id": "10_0_15",
        "question": "What are the anatomical entities including cell types, if any, where the human gene APOC1 is expressed at the post-juvenile stage along with its expression score independently of the strain and sex? Provide also the taxon scientific name and the gene description.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nSELECT DISTINCT ?cellType ?expressioncondition ?organism ?taxon ?anatomicalentity ?anatomicalentityName ?cellTypeName ?efo_0000399 ?score ?expression ?taxon_scientificname ?gene_description ?gene WHERE { \n\t?gene a orth:Gene .\n\t?expression a genex:Expression .\n\t?expression genex:hasExpressionCondition ?expressioncondition .\n\t?expression genex:hasExpressionLevel ?score .\n\t?expression genex:hasSequenceUnit ?gene .\n\t?gene rdfs:label \"APOC1\" .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anatomicalentity .\n\t?anatomicalentity a genex:AnatomicalEntity.\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?expressioncondition genex:hasAnatomicalEntity ?cellType .\n\t?cellType rdfs:label ?cellTypeName .\n\t?expressioncondition genex:hasDevelopmentalStage ?efo_0000399 .\n\t?efo_0000399 rdf:type efo:EFO_0000399 .\n\t?efo_0000399 rdfs:label \"post-juvenile\" .\n\t?gene orth:organism ?organism .\n\t?organism obo:RO_0002162  ?taxon .\n\t?taxon a up:Taxon .\n\t?taxon up:commonName \"human\" .\n\t?taxon <http://purl.uniprot.org/core/scientificName> ?taxon_scientificname.\n\t?gene <http://purl.org/dc/terms/description> ?gene_description.\n\tFILTER(     ?anatomicalentity !=  obo:GO_0005575     )\n\tFILTER(     ?anatomicalentity != ?cellType     )\n}"
    },
    {
        "id": "4_0_29",
        "question": "What are the anatomical entities where the APOC1 Homo sapiens gene is expressed? Provide also the taxon scientific name and the taxon common name and the anatomical entity label and the anatomical entity description and the gene description.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nSELECT DISTINCT ?organism ?taxon ?anatomicalentity_label ?anatomicalentity_description ?anatomicalentity ?anatomicalentityName ?gene_description ?taxon_scientificname ?gene ?taxon_commonname WHERE { \n\t?gene a orth:Gene .\n\t?gene genex:isExpressedIn ?anatomicalentity.\n\t?gene rdfs:label \"APOC1\" .\n\t?anatomicalentity a genex:AnatomicalEntity .\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t### Specifying species:\n\t?gene orth:organism ?organism .\n\t?organism obo:RO_0002162  ?taxon .\n\t?taxon a up:Taxon .\n\t?taxon up:scientificName \"Homo sapiens\" .\n\t?taxon <http://purl.uniprot.org/core/scientificName> ?taxon_scientificname.\n\t?taxon <http://purl.uniprot.org/core/commonName> ?taxon_commonname.\n\t?anatomicalentity <http://www.w3.org/2000/01/rdf-schema#label> ?anatomicalentity_label.\n\t?anatomicalentity <http://purl.org/dc/terms/description> ?anatomicalentity_description.\n\t?gene <http://purl.org/dc/terms/description> ?gene_description.\n}"
    },
    {
        "id": "1_0_3",
        "question": "What are the species present in Bgee? Provide also the taxon scientific name and the taxon common name.",
        "sparql": "PREFIX up: <http://purl.uniprot.org/core/>\nSELECT DISTINCT ?taxon_scientificname ?taxon_commonname ?taxon WHERE { \n\t?taxon a up:Taxon .\n\t?taxon <http://purl.uniprot.org/core/scientificName> ?taxon_scientificname.\n\t?taxon <http://purl.uniprot.org/core/commonName> ?taxon_commonname.\n}"
    },
    {
        "id": "3_0_5",
        "question": "What are the anatomical entities where the APOC1 gene is expressed? Provide also the anatomical entity description.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nSELECT DISTINCT ?gene ?anatomicalentity_description ?anatomicalentity ?anatomicalentityName WHERE { \n\t?gene a orth:Gene .\n\t?gene genex:isExpressedIn ?anatomicalentity .\n\t?gene rdfs:label \"APOC1\" .\n\t?anatomicalentity a genex:AnatomicalEntity .\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?anatomicalentity <http://purl.org/dc/terms/description> ?anatomicalentity_description.\n}"
    },
    {
        "id": "12_0_11",
        "question": "What are the anatomical entities where the eel gene apoc1 is expressed along with its expression score independently of the strain, sex, and cell type? Provide also the strain label and the gene see also.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nPREFIX up-taxon:<http://purl.uniprot.org/taxonomy/>\nPREFIX lscr: <http://purl.org/lscr#>\nPREFIX dcterms: <http://purl.org/dc/terms/>\nSELECT DISTINCT ?expressioncondition ?stageIRI ?anatName ?score ?efo_0005135 ?efo_0005135_label ?anat ?expression ?gene ?gene_seealso WHERE { \n\t?gene a orth:Gene .\n\t?expression a genex:Expression .\n\t?expression genex:hasExpressionCondition ?expressioncondition .\n\t?expression genex:hasExpressionLevel ?score .\n\t?expression genex:hasSequenceUnit ?gene .\n\t?gene dcterms:identifier \"118230125\" .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anat .\n\t?anat rdfs:label ?anatName .\n\t?expressioncondition genex:hasDevelopmentalStage ?stageIRI .\n\t?expressioncondition genex:hasSex \"any\".\n\t?expressioncondition genex:hasStrain ?efo_0005135 .\n\t?efo_0005135 a efo:EFO_0005135.\n\t?efo_0005135 rdfs:label \"wild-type\" .\n\t?efo_0005135 <http://www.w3.org/2000/01/rdf-schema#label> ?efo_0005135_label.\n\t?gene <http://www.w3.org/2000/01/rdf-schema#seeAlso> ?gene_seealso.\n\tFILTER(     ?anat !=  obo:GO_0005575     )\n}"
    },
    {
        "id": "8_0_8",
        "question": "What are the anatomical entities where the human gene APOC1 is expressed in the post-juvenile stage along with its expression score independently of the strain, sex, and cell type? Provide also the anatomical entity label.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nPREFIX up-taxon:<http://purl.uniprot.org/taxonomy/>\nPREFIX ensembl: <http://rdf.ebi.ac.uk/resource/ensembl/>\nPREFIX lscr: <http://purl.org/lscr#>\nSELECT DISTINCT ?expressioncondition ?anatomicalentity_label ?anatomicalentity ?anatomicalentityName ?expression ?score ?efo_0005135 ?gene WHERE { \n\t?gene a orth:Gene .\n\t?expression a genex:Expression .\n\t?expression genex:hasExpressionCondition ?expressioncondition .\n\t?expression genex:hasExpressionLevel ?score .\n\t?expression genex:hasSequenceUnit ?gene .\n\t?gene lscr:xrefEnsemblGene ensembl:ENSG00000130208 .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anatomicalentity .\n\t?anatomicalentity a genex:AnatomicalEntity.\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?expressioncondition genex:hasDevelopmentalStage obo:UBERON_0000113 .\n\t?expressioncondition genex:hasSex \"any\".\n\t?expressioncondition genex:hasStrain ?efo_0005135 .\n\t?efo_0005135 a efo:EFO_0005135.\n\t?efo_0005135 rdfs:label \"wild-type\" .\n\t?anatomicalentity <http://www.w3.org/2000/01/rdf-schema#label> ?anatomicalentity_label.\n\tFILTER(   ?anatomicalentity !=  obo:GO_0005575   )\n}"
    },
    {
        "id": "13_0_5",
        "question": "What are the anatomical entities where the P02654 gene is expressed? Note that P02654 is a UniProtKB identifier of the APOC1 human gene. Provide also the anatomical entity description.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up-protein:<http://purl.uniprot.org/uniprot/>\nPREFIX lscr: <http://purl.org/lscr#>\nSELECT DISTINCT ?gene ?anatomicalentity_description ?anatomicalentity ?anatomicalentityName WHERE { \n\t?gene a orth:Gene .\n\t?gene genex:isExpressedIn ?anatomicalentity .\n\t?gene lscr:xrefUniprot up-protein:P02654 .\n\t?anatomicalentity a genex:AnatomicalEntity .\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?anatomicalentity <http://purl.org/dc/terms/description> ?anatomicalentity_description.\n}"
    },
    {
        "id": "13_0_0",
        "question": "What are the anatomical entities where the P02654 gene is expressed? Note that P02654 is a UniProtKB identifier of the APOC1 human gene.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up-protein:<http://purl.uniprot.org/uniprot/>\nPREFIX lscr: <http://purl.org/lscr#>\nSELECT DISTINCT ?anatomicalentity ?gene ?anatomicalentityName WHERE { \n\t?gene a orth:Gene .\n\t?gene genex:isExpressedIn ?anatomicalentity .\n\t?gene lscr:xrefUniprot up-protein:P02654 .\n\t?anatomicalentity a genex:AnatomicalEntity .\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n}"
    },
    {
        "id": "8_0_6",
        "question": "What are the anatomical entities where the human gene APOC1 is expressed in the post-juvenile stage along with its expression score independently of the strain, sex, and cell type? Provide also the gene expression has expression level score.",
        "sparql": "PREFIX orth: <http://purl.org/net/orth#>\nPREFIX genex: <http://purl.org/genex#>\nPREFIX obo: <http://purl.obolibrary.org/obo/>\nPREFIX up: <http://purl.uniprot.org/core/>\nPREFIX up-taxon:<http://purl.uniprot.org/taxonomy/>\nPREFIX ensembl: <http://rdf.ebi.ac.uk/resource/ensembl/>\nPREFIX lscr: <http://purl.org/lscr#>\nSELECT DISTINCT ?expressioncondition ?anatomicalentity ?anatomicalentityName ?expression_hasexpressionlevelscore ?expression ?score ?efo_0005135 ?gene WHERE { \n\t?gene a orth:Gene .\n\t?expression a genex:Expression .\n\t?expression genex:hasExpressionCondition ?expressioncondition .\n\t?expression genex:hasExpressionLevel ?score .\n\t?expression genex:hasSequenceUnit ?gene .\n\t?gene lscr:xrefEnsemblGene ensembl:ENSG00000130208 .\n\t?expressioncondition a genex:ExpressionCondition.\n\t?expressioncondition genex:hasAnatomicalEntity ?anatomicalentity .\n\t?anatomicalentity a genex:AnatomicalEntity.\n\t?anatomicalentity rdfs:label ?anatomicalentityName .\n\t?expressioncondition genex:hasDevelopmentalStage obo:UBERON_0000113 .\n\t?expressioncondition genex:hasSex \"any\".\n\t?expressioncondition genex:hasStrain ?efo_0005135 .\n\t?efo_0005135 a efo:EFO_0005135.\n\t?efo_0005135 rdfs:label \"wild-type\" .\n\t?expression <http://purl.org/genex#hasExpressionLevel> ?expression_hasexpressionlevelscore.\n\tFILTER(   ?anatomicalentity !=  obo:GO_0005575   )\n}"
    }
]